namespace Engine.Logic.Locations.Animation
{

    /// <summary>
    /// 
    /// Тип атаки
    /// ---
    /// 
    /// 
    /// </summary>
    public enum AttackType : int
    {

        /// <summary>
        ///     Ничего не происходит, дополнительной анимации нет
        ///     ---
        ///     
        /// </summary>
        Empty = 0x00,

        /// <summary>
        ///     Одиночный выстрел, происходит анимация отдачи
        ///     ---
        ///     
        /// </summary>
        SingleShot = 0x01,

        /// <summary>
        ///     Стрельба очередью, происходит анимация отдачи
        ///     ---
        ///     
        /// </summary>
        BurstFiring = 0x02,

        /// <summary>
        ///     Перезарядка, происходит анимация смены обоймы
        ///     ---
        ///     
        /// </summary>
        Reload = 0x03,

        /// <summary>
        ///     Атака в ближнем бою, происходит анимация махания оружием
        ///     ---
        ///     
        /// </summary>
        EdgedAttack = 0x04,

        /// <summary>
        ///     Атака метанием оружия ближнего боя, происходит анимация замаха при броске
        ///     ---
        ///     
        /// </summary>
        EdgedThrow = 0x05,

        /// <summary>
        ///     Атака гранатой, происходит анимация замаха при броске
        ///     ---
        ///     
        /// </summary>
        GrenadeThrow = 0x06,

        /// <summary>
        ///     Атака голыми руками, происходит анимация махания кулаками
        ///     ---
        ///     
        /// </summary>
        HandsAttack = 0x0f,

    };

}
